# 1.შევქმნათ დასტა :
#   ა)შევქმნათ ფერისა და ნახატის ლისტები და გადავუაროთ ორივეს 2 for ციკლით (ჩაშენებულით)
# 2.დავწეროთ input ფუნქცია რომელიც მიიღებს სამი მოთმაშის სახელს
# 3.შევქმნატ 5-5 კარტის დაგენერირების ფუნქცია.ამოარჩიოს კარტის დასტიდან (გასათალისწინებელია რომ ყოველი შემდეგი ამორჩული კარტი ამოირჩევა აწ უკვე ნაკლული 4 დასტიდან)
#--პირველი სამი ფუნქცია გავაერთიანოთ main ფუნქციაში
#    
# 4.ჩავამატოტ თმაშის პირობები.
#   მივანიჭოთ კარტებს თვიანთი ქულები.
#   ა)კარტების ფერების რაოდენობის მიხედვით მოგება--მაქსიმალური ერთფერიანების რაოდენობა დავთალოთ
#   ფრის შემთხვევაშო->
#   ბ) მნიშვნელობების მიხედვით გამარჯვება.მნიშვნელობების მაქსიმალური რაოდენობა .
#   გასათვალისწინებელია კარტების ქულებიც ფრეების შემთხვევაში?!
#   თუ ფრეა, ფრეა!
#
#   დავბეჭდოთ
# 
# 5.კარტის შეცვლის ფუნქცია
#   შეიყვანს კარტს რომლის ეცვლაც სურს და რენდომულად მოუვა დასტიდან ერთი კარტი.
#
#   დავბეჭდოთ შეცვლილი კარტებით
#   
#   გამოავლინოს დამარცხებული და გააგდოს
#
#   თვიდან დაარიგოს დარჩენილი ორი მოთმაშისვთის
#
#   გასათაისწინებელია ის ფაქტიც რომ როცა წაგებულს გამოვავლენთ 2 ჯერ მოგვიწევს შედარების ოპერაციის გაკეთება  ან კიდევ ამის თავის არიდების მიზნით  მინიმუმები ვიპოვოთ.
#